{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Experiment with Similarities - Movie Recommendation Graphs.ipynb","provenance":[{"file_id":"1ZLKfXLcGr7qz68o6v9HH1RBKM6ew3igN","timestamp":1606350460883},{"file_id":"1wS0h-CNcCluuj1bWSWAZLmQXRhFTdWs4","timestamp":1605656004116}],"collapsed_sections":[]},"kernelspec":{"name":"python3","display_name":"Python 3"},"accelerator":"GPU"},"cells":[{"cell_type":"markdown","metadata":{"id":"JJth19AtbEw4"},"source":["https://medium.com/@yesilliali/design-a-movie-recommendation-system-with-using-graph-database-neo4j-part-1-2c4933f4da0a"]},{"cell_type":"code","metadata":{"id":"grtPPWJluovi","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1606352801259,"user_tz":180,"elapsed":28609,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"505ed6ad-18fb-47c7-f3ca-528e09115a83"},"source":["from google.colab import drive, auth\n","\n","#auth.authenticate_user()\n","drive.mount('/content/gdrive', force_remount=True)"],"execution_count":2,"outputs":[{"output_type":"stream","text":["Mounted at /content/gdrive\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"HWm-I2KaGZm1"},"source":["a = []\n","while(1):\n","    a.append('1')"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"tKGYNkR7PeZF","executionInfo":{"status":"ok","timestamp":1606352804566,"user_tz":180,"elapsed":1615,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["import pandas as pd\n","import numpy as np\n","import datetime\n","from collections import Counter\n","from sklearn.metrics.pairwise import cosine_similarity"],"execution_count":3,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"GujiTjrKkLSc","executionInfo":{"status":"ok","timestamp":1606352806665,"user_tz":180,"elapsed":769,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"50190c36-7ef7-4249-c539-db8e9240bf50"},"source":["%cd gdrive/Shareddrives/Movie-Recommendation"],"execution_count":4,"outputs":[{"output_type":"stream","text":["/content/gdrive/Shareddrives/Movie-Recommendation\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"x9PcrxcgPpEe","executionInfo":{"status":"ok","timestamp":1606352828681,"user_tz":180,"elapsed":21056,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["genome_scores_data = pd.read_csv(\"Datasets/genome-scores.csv\") # movies with tags and their respective relevance for this movie\n","movies_data = pd.read_csv(\"Datasets/movies.csv\") # movies with title and genre\n","ratings_data = pd.read_csv(\"Datasets/ratings.csv\") # ratings per user and movieId with timestamp"],"execution_count":5,"outputs":[]},{"cell_type":"code","metadata":{"id":"QvSGzMsqXGZw","executionInfo":{"status":"ok","timestamp":1606352828684,"user_tz":180,"elapsed":10940,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["ratings_data = ratings_data[ratings_data.userId <= 5000] #Reduzindo tamanho do dataset para 5k usuários"],"execution_count":6,"outputs":[]},{"cell_type":"code","metadata":{"id":"X2IJ8Rd4SEei","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352828686,"user_tz":180,"elapsed":7277,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"a6eadc66-d82f-4f34-a743-9f417d9a0a15"},"source":["genome_scores_data.head()"],"execution_count":7,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>tagId</th>\n","      <th>relevance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>1</td>\n","      <td>0.02875</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>1</td>\n","      <td>2</td>\n","      <td>0.02375</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>1</td>\n","      <td>3</td>\n","      <td>0.06250</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>1</td>\n","      <td>4</td>\n","      <td>0.07575</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>1</td>\n","      <td>5</td>\n","      <td>0.14075</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId  tagId  relevance\n","0        1      1    0.02875\n","1        1      2    0.02375\n","2        1      3    0.06250\n","3        1      4    0.07575\n","4        1      5    0.14075"]},"metadata":{"tags":[]},"execution_count":7}]},{"cell_type":"code","metadata":{"id":"rogEkGc5pzMz","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352831648,"user_tz":180,"elapsed":703,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"4ec7a005-bded-4d1b-daf0-3cad91682e00"},"source":["movies_data.head()"],"execution_count":8,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>title</th>\n","      <th>genres</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Toy Story (1995)</td>\n","      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>Jumanji (1995)</td>\n","      <td>Adventure|Children|Fantasy</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>Grumpier Old Men (1995)</td>\n","      <td>Comedy|Romance</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>Waiting to Exhale (1995)</td>\n","      <td>Comedy|Drama|Romance</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>Father of the Bride Part II (1995)</td>\n","      <td>Comedy</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId  ...                                       genres\n","0        1  ...  Adventure|Animation|Children|Comedy|Fantasy\n","1        2  ...                   Adventure|Children|Fantasy\n","2        3  ...                               Comedy|Romance\n","3        4  ...                         Comedy|Drama|Romance\n","4        5  ...                                       Comedy\n","\n","[5 rows x 3 columns]"]},"metadata":{"tags":[]},"execution_count":8}]},{"cell_type":"code","metadata":{"id":"wPy1pNvvSFFr","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352833450,"user_tz":180,"elapsed":818,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"d8253ba0-0c69-4ea8-a2f1-b908725183b2"},"source":["ratings_data.tail()"],"execution_count":9,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>userId</th>\n","      <th>movieId</th>\n","      <th>rating</th>\n","      <th>timestamp</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>733150</th>\n","      <td>5000</td>\n","      <td>1073</td>\n","      <td>2.0</td>\n","      <td>858342982</td>\n","    </tr>\n","    <tr>\n","      <th>733151</th>\n","      <td>5000</td>\n","      <td>1210</td>\n","      <td>3.0</td>\n","      <td>858343150</td>\n","    </tr>\n","    <tr>\n","      <th>733152</th>\n","      <td>5000</td>\n","      <td>1356</td>\n","      <td>3.0</td>\n","      <td>858343314</td>\n","    </tr>\n","    <tr>\n","      <th>733153</th>\n","      <td>5000</td>\n","      <td>1393</td>\n","      <td>4.0</td>\n","      <td>858343314</td>\n","    </tr>\n","    <tr>\n","      <th>733154</th>\n","      <td>5000</td>\n","      <td>1416</td>\n","      <td>2.0</td>\n","      <td>858343390</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["        userId  movieId  rating  timestamp\n","733150    5000     1073     2.0  858342982\n","733151    5000     1210     3.0  858343150\n","733152    5000     1356     3.0  858343314\n","733153    5000     1393     4.0  858343314\n","733154    5000     1416     2.0  858343390"]},"metadata":{"tags":[]},"execution_count":9}]},{"cell_type":"code","metadata":{"id":"cSWacCbIS3uC","colab":{"base_uri":"https://localhost:8080/","height":253},"executionInfo":{"status":"ok","timestamp":1606352844657,"user_tz":180,"elapsed":10138,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"ea327c4c-5c31-461e-944b-67c18dc0ad42"},"source":["scores_pivot = genome_scores_data.pivot_table(index = [\"movieId\"],columns = [\"tagId\"],values = \"relevance\").reset_index()\n","scores_pivot.head()"],"execution_count":10,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th>tagId</th>\n","      <th>movieId</th>\n","      <th>1</th>\n","      <th>2</th>\n","      <th>3</th>\n","      <th>4</th>\n","      <th>5</th>\n","      <th>6</th>\n","      <th>7</th>\n","      <th>8</th>\n","      <th>9</th>\n","      <th>10</th>\n","      <th>11</th>\n","      <th>12</th>\n","      <th>13</th>\n","      <th>14</th>\n","      <th>15</th>\n","      <th>16</th>\n","      <th>17</th>\n","      <th>18</th>\n","      <th>19</th>\n","      <th>20</th>\n","      <th>21</th>\n","      <th>22</th>\n","      <th>23</th>\n","      <th>24</th>\n","      <th>25</th>\n","      <th>26</th>\n","      <th>27</th>\n","      <th>28</th>\n","      <th>29</th>\n","      <th>30</th>\n","      <th>31</th>\n","      <th>32</th>\n","      <th>33</th>\n","      <th>34</th>\n","      <th>35</th>\n","      <th>36</th>\n","      <th>37</th>\n","      <th>38</th>\n","      <th>39</th>\n","      <th>...</th>\n","      <th>1089</th>\n","      <th>1090</th>\n","      <th>1091</th>\n","      <th>1092</th>\n","      <th>1093</th>\n","      <th>1094</th>\n","      <th>1095</th>\n","      <th>1096</th>\n","      <th>1097</th>\n","      <th>1098</th>\n","      <th>1099</th>\n","      <th>1100</th>\n","      <th>1101</th>\n","      <th>1102</th>\n","      <th>1103</th>\n","      <th>1104</th>\n","      <th>1105</th>\n","      <th>1106</th>\n","      <th>1107</th>\n","      <th>1108</th>\n","      <th>1109</th>\n","      <th>1110</th>\n","      <th>1111</th>\n","      <th>1112</th>\n","      <th>1113</th>\n","      <th>1114</th>\n","      <th>1115</th>\n","      <th>1116</th>\n","      <th>1117</th>\n","      <th>1118</th>\n","      <th>1119</th>\n","      <th>1120</th>\n","      <th>1121</th>\n","      <th>1122</th>\n","      <th>1123</th>\n","      <th>1124</th>\n","      <th>1125</th>\n","      <th>1126</th>\n","      <th>1127</th>\n","      <th>1128</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>0.02875</td>\n","      <td>0.02375</td>\n","      <td>0.06250</td>\n","      <td>0.07575</td>\n","      <td>0.14075</td>\n","      <td>0.14675</td>\n","      <td>0.06350</td>\n","      <td>0.20375</td>\n","      <td>0.2020</td>\n","      <td>0.03075</td>\n","      <td>0.58025</td>\n","      <td>0.10250</td>\n","      <td>0.20175</td>\n","      <td>0.00700</td>\n","      <td>0.02450</td>\n","      <td>0.17275</td>\n","      <td>0.01650</td>\n","      <td>0.10400</td>\n","      <td>0.66250</td>\n","      <td>0.30075</td>\n","      <td>0.31675</td>\n","      <td>0.28600</td>\n","      <td>0.06275</td>\n","      <td>0.01925</td>\n","      <td>0.05875</td>\n","      <td>0.07925</td>\n","      <td>0.19650</td>\n","      <td>0.09325</td>\n","      <td>0.89375</td>\n","      <td>0.67625</td>\n","      <td>0.03575</td>\n","      <td>0.23325</td>\n","      <td>0.30750</td>\n","      <td>0.05450</td>\n","      <td>0.03800</td>\n","      <td>0.21200</td>\n","      <td>0.08000</td>\n","      <td>0.01550</td>\n","      <td>0.01950</td>\n","      <td>...</td>\n","      <td>0.15150</td>\n","      <td>0.56375</td>\n","      <td>0.3150</td>\n","      <td>0.67325</td>\n","      <td>0.43650</td>\n","      <td>0.01550</td>\n","      <td>0.07050</td>\n","      <td>0.06550</td>\n","      <td>0.05225</td>\n","      <td>0.12775</td>\n","      <td>0.00400</td>\n","      <td>0.09750</td>\n","      <td>0.26375</td>\n","      <td>0.02175</td>\n","      <td>0.02250</td>\n","      <td>0.42700</td>\n","      <td>0.07175</td>\n","      <td>0.01400</td>\n","      <td>0.03550</td>\n","      <td>0.58700</td>\n","      <td>0.08775</td>\n","      <td>0.03775</td>\n","      <td>0.07150</td>\n","      <td>0.03325</td>\n","      <td>0.10550</td>\n","      <td>0.69400</td>\n","      <td>0.10800</td>\n","      <td>0.08925</td>\n","      <td>0.05500</td>\n","      <td>0.07700</td>\n","      <td>0.04050</td>\n","      <td>0.01425</td>\n","      <td>0.03050</td>\n","      <td>0.03500</td>\n","      <td>0.14125</td>\n","      <td>0.05775</td>\n","      <td>0.03900</td>\n","      <td>0.02975</td>\n","      <td>0.08475</td>\n","      <td>0.02200</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>0.04125</td>\n","      <td>0.04050</td>\n","      <td>0.06275</td>\n","      <td>0.08275</td>\n","      <td>0.09100</td>\n","      <td>0.06125</td>\n","      <td>0.06925</td>\n","      <td>0.09600</td>\n","      <td>0.0765</td>\n","      <td>0.05250</td>\n","      <td>0.08800</td>\n","      <td>0.10275</td>\n","      <td>0.14525</td>\n","      <td>0.00700</td>\n","      <td>0.00450</td>\n","      <td>0.02750</td>\n","      <td>0.01075</td>\n","      <td>0.15925</td>\n","      <td>0.64025</td>\n","      <td>0.36725</td>\n","      <td>0.51450</td>\n","      <td>0.48450</td>\n","      <td>0.19725</td>\n","      <td>0.24875</td>\n","      <td>0.08325</td>\n","      <td>0.15700</td>\n","      <td>0.14550</td>\n","      <td>0.05825</td>\n","      <td>0.97600</td>\n","      <td>0.12675</td>\n","      <td>0.01050</td>\n","      <td>0.07350</td>\n","      <td>0.07075</td>\n","      <td>0.06900</td>\n","      <td>0.10975</td>\n","      <td>0.29775</td>\n","      <td>0.06200</td>\n","      <td>0.02000</td>\n","      <td>0.02750</td>\n","      <td>...</td>\n","      <td>0.07325</td>\n","      <td>0.38150</td>\n","      <td>0.2250</td>\n","      <td>0.21700</td>\n","      <td>0.31525</td>\n","      <td>0.02225</td>\n","      <td>0.05375</td>\n","      <td>0.03775</td>\n","      <td>0.03075</td>\n","      <td>0.05800</td>\n","      <td>0.00475</td>\n","      <td>0.03750</td>\n","      <td>0.17800</td>\n","      <td>0.01600</td>\n","      <td>0.02075</td>\n","      <td>0.38650</td>\n","      <td>0.09650</td>\n","      <td>0.02425</td>\n","      <td>0.01300</td>\n","      <td>0.29250</td>\n","      <td>0.09375</td>\n","      <td>0.04975</td>\n","      <td>0.02225</td>\n","      <td>0.24300</td>\n","      <td>0.38525</td>\n","      <td>0.18725</td>\n","      <td>0.21700</td>\n","      <td>0.13525</td>\n","      <td>0.01800</td>\n","      <td>0.08725</td>\n","      <td>0.05250</td>\n","      <td>0.01575</td>\n","      <td>0.01250</td>\n","      <td>0.02000</td>\n","      <td>0.12225</td>\n","      <td>0.03275</td>\n","      <td>0.02100</td>\n","      <td>0.01100</td>\n","      <td>0.10525</td>\n","      <td>0.01975</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>0.04675</td>\n","      <td>0.05550</td>\n","      <td>0.02925</td>\n","      <td>0.08700</td>\n","      <td>0.04750</td>\n","      <td>0.04775</td>\n","      <td>0.04600</td>\n","      <td>0.14275</td>\n","      <td>0.0285</td>\n","      <td>0.03875</td>\n","      <td>0.02450</td>\n","      <td>0.06475</td>\n","      <td>0.08100</td>\n","      <td>0.00550</td>\n","      <td>0.00500</td>\n","      <td>0.03475</td>\n","      <td>0.00675</td>\n","      <td>0.11375</td>\n","      <td>0.16025</td>\n","      <td>0.14075</td>\n","      <td>0.25200</td>\n","      <td>0.19375</td>\n","      <td>0.10425</td>\n","      <td>0.01675</td>\n","      <td>0.04875</td>\n","      <td>0.06450</td>\n","      <td>0.13175</td>\n","      <td>0.08625</td>\n","      <td>0.32150</td>\n","      <td>0.09550</td>\n","      <td>0.01200</td>\n","      <td>0.03575</td>\n","      <td>0.05975</td>\n","      <td>0.06625</td>\n","      <td>0.05300</td>\n","      <td>0.28575</td>\n","      <td>0.05275</td>\n","      <td>0.02900</td>\n","      <td>0.03650</td>\n","      <td>...</td>\n","      <td>0.10175</td>\n","      <td>0.10725</td>\n","      <td>0.1960</td>\n","      <td>0.09850</td>\n","      <td>0.04950</td>\n","      <td>0.02100</td>\n","      <td>0.06250</td>\n","      <td>0.03500</td>\n","      <td>0.03150</td>\n","      <td>0.07600</td>\n","      <td>0.02000</td>\n","      <td>0.04725</td>\n","      <td>0.14125</td>\n","      <td>0.42725</td>\n","      <td>0.03525</td>\n","      <td>0.24350</td>\n","      <td>0.06100</td>\n","      <td>0.02000</td>\n","      <td>0.03800</td>\n","      <td>0.13025</td>\n","      <td>0.13325</td>\n","      <td>0.03950</td>\n","      <td>0.02500</td>\n","      <td>0.01950</td>\n","      <td>0.02950</td>\n","      <td>0.22325</td>\n","      <td>0.02650</td>\n","      <td>0.35075</td>\n","      <td>0.02150</td>\n","      <td>0.07325</td>\n","      <td>0.06275</td>\n","      <td>0.01950</td>\n","      <td>0.02225</td>\n","      <td>0.02300</td>\n","      <td>0.12200</td>\n","      <td>0.03475</td>\n","      <td>0.01700</td>\n","      <td>0.01800</td>\n","      <td>0.09100</td>\n","      <td>0.01775</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>0.03425</td>\n","      <td>0.03800</td>\n","      <td>0.04050</td>\n","      <td>0.03100</td>\n","      <td>0.06500</td>\n","      <td>0.03575</td>\n","      <td>0.02900</td>\n","      <td>0.08650</td>\n","      <td>0.0320</td>\n","      <td>0.03150</td>\n","      <td>0.02800</td>\n","      <td>0.03475</td>\n","      <td>0.07775</td>\n","      <td>0.01325</td>\n","      <td>0.00325</td>\n","      <td>0.02650</td>\n","      <td>0.01875</td>\n","      <td>0.13375</td>\n","      <td>0.14700</td>\n","      <td>0.11025</td>\n","      <td>0.50700</td>\n","      <td>0.46175</td>\n","      <td>0.11000</td>\n","      <td>0.01700</td>\n","      <td>0.07450</td>\n","      <td>0.06075</td>\n","      <td>0.12525</td>\n","      <td>0.61775</td>\n","      <td>0.14875</td>\n","      <td>0.13150</td>\n","      <td>0.01350</td>\n","      <td>0.04050</td>\n","      <td>0.05250</td>\n","      <td>0.03725</td>\n","      <td>0.04550</td>\n","      <td>0.10175</td>\n","      <td>0.09650</td>\n","      <td>0.01225</td>\n","      <td>0.01800</td>\n","      <td>...</td>\n","      <td>0.08800</td>\n","      <td>0.10750</td>\n","      <td>0.2115</td>\n","      <td>0.11625</td>\n","      <td>0.06575</td>\n","      <td>0.02975</td>\n","      <td>0.04350</td>\n","      <td>0.03425</td>\n","      <td>0.02000</td>\n","      <td>0.06650</td>\n","      <td>0.01550</td>\n","      <td>0.02050</td>\n","      <td>0.28950</td>\n","      <td>0.08225</td>\n","      <td>0.02700</td>\n","      <td>0.21975</td>\n","      <td>0.06975</td>\n","      <td>0.02525</td>\n","      <td>0.01800</td>\n","      <td>0.14775</td>\n","      <td>0.06450</td>\n","      <td>0.22400</td>\n","      <td>0.03850</td>\n","      <td>0.02275</td>\n","      <td>0.03625</td>\n","      <td>0.10725</td>\n","      <td>0.02875</td>\n","      <td>0.97525</td>\n","      <td>0.02075</td>\n","      <td>0.38650</td>\n","      <td>0.05325</td>\n","      <td>0.02800</td>\n","      <td>0.01675</td>\n","      <td>0.03875</td>\n","      <td>0.18200</td>\n","      <td>0.07050</td>\n","      <td>0.01625</td>\n","      <td>0.01425</td>\n","      <td>0.08850</td>\n","      <td>0.01500</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>0.04300</td>\n","      <td>0.05325</td>\n","      <td>0.03800</td>\n","      <td>0.04100</td>\n","      <td>0.05400</td>\n","      <td>0.06725</td>\n","      <td>0.02775</td>\n","      <td>0.07650</td>\n","      <td>0.0215</td>\n","      <td>0.02975</td>\n","      <td>0.02775</td>\n","      <td>0.03300</td>\n","      <td>0.05050</td>\n","      <td>0.00825</td>\n","      <td>0.00300</td>\n","      <td>0.02525</td>\n","      <td>0.01800</td>\n","      <td>0.15475</td>\n","      <td>0.15575</td>\n","      <td>0.16825</td>\n","      <td>0.28925</td>\n","      <td>0.19800</td>\n","      <td>0.08900</td>\n","      <td>0.02250</td>\n","      <td>0.04425</td>\n","      <td>0.04775</td>\n","      <td>0.21750</td>\n","      <td>0.11300</td>\n","      <td>0.16350</td>\n","      <td>0.11875</td>\n","      <td>0.01150</td>\n","      <td>0.03500</td>\n","      <td>0.06300</td>\n","      <td>0.02575</td>\n","      <td>0.10925</td>\n","      <td>0.19875</td>\n","      <td>0.03225</td>\n","      <td>0.02800</td>\n","      <td>0.05175</td>\n","      <td>...</td>\n","      <td>0.08275</td>\n","      <td>0.11925</td>\n","      <td>0.1850</td>\n","      <td>0.11875</td>\n","      <td>0.07150</td>\n","      <td>0.01475</td>\n","      <td>0.05450</td>\n","      <td>0.03475</td>\n","      <td>0.02800</td>\n","      <td>0.07075</td>\n","      <td>0.00650</td>\n","      <td>0.02800</td>\n","      <td>0.12025</td>\n","      <td>0.64475</td>\n","      <td>0.02025</td>\n","      <td>0.29350</td>\n","      <td>0.05900</td>\n","      <td>0.02025</td>\n","      <td>0.02275</td>\n","      <td>0.16425</td>\n","      <td>0.09125</td>\n","      <td>0.07850</td>\n","      <td>0.03275</td>\n","      <td>0.02450</td>\n","      <td>0.03500</td>\n","      <td>0.10475</td>\n","      <td>0.03350</td>\n","      <td>0.40225</td>\n","      <td>0.01875</td>\n","      <td>0.11200</td>\n","      <td>0.05350</td>\n","      <td>0.02050</td>\n","      <td>0.01425</td>\n","      <td>0.02550</td>\n","      <td>0.19225</td>\n","      <td>0.02675</td>\n","      <td>0.01625</td>\n","      <td>0.01300</td>\n","      <td>0.08700</td>\n","      <td>0.01600</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>5 rows × 1129 columns</p>\n","</div>"],"text/plain":["tagId  movieId        1        2        3  ...     1125     1126     1127     1128\n","0            1  0.02875  0.02375  0.06250  ...  0.03900  0.02975  0.08475  0.02200\n","1            2  0.04125  0.04050  0.06275  ...  0.02100  0.01100  0.10525  0.01975\n","2            3  0.04675  0.05550  0.02925  ...  0.01700  0.01800  0.09100  0.01775\n","3            4  0.03425  0.03800  0.04050  ...  0.01625  0.01425  0.08850  0.01500\n","4            5  0.04300  0.05325  0.03800  ...  0.01625  0.01300  0.08700  0.01600\n","\n","[5 rows x 1129 columns]"]},"metadata":{"tags":[]},"execution_count":10}]},{"cell_type":"code","metadata":{"id":"lhD9g9v6S6HK","colab":{"base_uri":"https://localhost:8080/","height":253},"executionInfo":{"status":"ok","timestamp":1606352845552,"user_tz":180,"elapsed":8513,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"7a75b21b-426b-4a8d-9073-c50d657510a7"},"source":["#join\n","mov_tag_df = movies_data.merge(scores_pivot, left_on=\"movieId\", right_on=\"movieId\", how=\"left\")\n","mov_tag_df = mov_tag_df.fillna(0) \n","mov_tag_df = mov_tag_df.drop(['title','genres'], axis = 1)\n","mov_tag_df.head()"],"execution_count":11,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>1</th>\n","      <th>2</th>\n","      <th>3</th>\n","      <th>4</th>\n","      <th>5</th>\n","      <th>6</th>\n","      <th>7</th>\n","      <th>8</th>\n","      <th>9</th>\n","      <th>10</th>\n","      <th>11</th>\n","      <th>12</th>\n","      <th>13</th>\n","      <th>14</th>\n","      <th>15</th>\n","      <th>16</th>\n","      <th>17</th>\n","      <th>18</th>\n","      <th>19</th>\n","      <th>20</th>\n","      <th>21</th>\n","      <th>22</th>\n","      <th>23</th>\n","      <th>24</th>\n","      <th>25</th>\n","      <th>26</th>\n","      <th>27</th>\n","      <th>28</th>\n","      <th>29</th>\n","      <th>30</th>\n","      <th>31</th>\n","      <th>32</th>\n","      <th>33</th>\n","      <th>34</th>\n","      <th>35</th>\n","      <th>36</th>\n","      <th>37</th>\n","      <th>38</th>\n","      <th>39</th>\n","      <th>...</th>\n","      <th>1089</th>\n","      <th>1090</th>\n","      <th>1091</th>\n","      <th>1092</th>\n","      <th>1093</th>\n","      <th>1094</th>\n","      <th>1095</th>\n","      <th>1096</th>\n","      <th>1097</th>\n","      <th>1098</th>\n","      <th>1099</th>\n","      <th>1100</th>\n","      <th>1101</th>\n","      <th>1102</th>\n","      <th>1103</th>\n","      <th>1104</th>\n","      <th>1105</th>\n","      <th>1106</th>\n","      <th>1107</th>\n","      <th>1108</th>\n","      <th>1109</th>\n","      <th>1110</th>\n","      <th>1111</th>\n","      <th>1112</th>\n","      <th>1113</th>\n","      <th>1114</th>\n","      <th>1115</th>\n","      <th>1116</th>\n","      <th>1117</th>\n","      <th>1118</th>\n","      <th>1119</th>\n","      <th>1120</th>\n","      <th>1121</th>\n","      <th>1122</th>\n","      <th>1123</th>\n","      <th>1124</th>\n","      <th>1125</th>\n","      <th>1126</th>\n","      <th>1127</th>\n","      <th>1128</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>0.02875</td>\n","      <td>0.02375</td>\n","      <td>0.06250</td>\n","      <td>0.07575</td>\n","      <td>0.14075</td>\n","      <td>0.14675</td>\n","      <td>0.06350</td>\n","      <td>0.20375</td>\n","      <td>0.2020</td>\n","      <td>0.03075</td>\n","      <td>0.58025</td>\n","      <td>0.10250</td>\n","      <td>0.20175</td>\n","      <td>0.00700</td>\n","      <td>0.02450</td>\n","      <td>0.17275</td>\n","      <td>0.01650</td>\n","      <td>0.10400</td>\n","      <td>0.66250</td>\n","      <td>0.30075</td>\n","      <td>0.31675</td>\n","      <td>0.28600</td>\n","      <td>0.06275</td>\n","      <td>0.01925</td>\n","      <td>0.05875</td>\n","      <td>0.07925</td>\n","      <td>0.19650</td>\n","      <td>0.09325</td>\n","      <td>0.89375</td>\n","      <td>0.67625</td>\n","      <td>0.03575</td>\n","      <td>0.23325</td>\n","      <td>0.30750</td>\n","      <td>0.05450</td>\n","      <td>0.03800</td>\n","      <td>0.21200</td>\n","      <td>0.08000</td>\n","      <td>0.01550</td>\n","      <td>0.01950</td>\n","      <td>...</td>\n","      <td>0.15150</td>\n","      <td>0.56375</td>\n","      <td>0.3150</td>\n","      <td>0.67325</td>\n","      <td>0.43650</td>\n","      <td>0.01550</td>\n","      <td>0.07050</td>\n","      <td>0.06550</td>\n","      <td>0.05225</td>\n","      <td>0.12775</td>\n","      <td>0.00400</td>\n","      <td>0.09750</td>\n","      <td>0.26375</td>\n","      <td>0.02175</td>\n","      <td>0.02250</td>\n","      <td>0.42700</td>\n","      <td>0.07175</td>\n","      <td>0.01400</td>\n","      <td>0.03550</td>\n","      <td>0.58700</td>\n","      <td>0.08775</td>\n","      <td>0.03775</td>\n","      <td>0.07150</td>\n","      <td>0.03325</td>\n","      <td>0.10550</td>\n","      <td>0.69400</td>\n","      <td>0.10800</td>\n","      <td>0.08925</td>\n","      <td>0.05500</td>\n","      <td>0.07700</td>\n","      <td>0.04050</td>\n","      <td>0.01425</td>\n","      <td>0.03050</td>\n","      <td>0.03500</td>\n","      <td>0.14125</td>\n","      <td>0.05775</td>\n","      <td>0.03900</td>\n","      <td>0.02975</td>\n","      <td>0.08475</td>\n","      <td>0.02200</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>0.04125</td>\n","      <td>0.04050</td>\n","      <td>0.06275</td>\n","      <td>0.08275</td>\n","      <td>0.09100</td>\n","      <td>0.06125</td>\n","      <td>0.06925</td>\n","      <td>0.09600</td>\n","      <td>0.0765</td>\n","      <td>0.05250</td>\n","      <td>0.08800</td>\n","      <td>0.10275</td>\n","      <td>0.14525</td>\n","      <td>0.00700</td>\n","      <td>0.00450</td>\n","      <td>0.02750</td>\n","      <td>0.01075</td>\n","      <td>0.15925</td>\n","      <td>0.64025</td>\n","      <td>0.36725</td>\n","      <td>0.51450</td>\n","      <td>0.48450</td>\n","      <td>0.19725</td>\n","      <td>0.24875</td>\n","      <td>0.08325</td>\n","      <td>0.15700</td>\n","      <td>0.14550</td>\n","      <td>0.05825</td>\n","      <td>0.97600</td>\n","      <td>0.12675</td>\n","      <td>0.01050</td>\n","      <td>0.07350</td>\n","      <td>0.07075</td>\n","      <td>0.06900</td>\n","      <td>0.10975</td>\n","      <td>0.29775</td>\n","      <td>0.06200</td>\n","      <td>0.02000</td>\n","      <td>0.02750</td>\n","      <td>...</td>\n","      <td>0.07325</td>\n","      <td>0.38150</td>\n","      <td>0.2250</td>\n","      <td>0.21700</td>\n","      <td>0.31525</td>\n","      <td>0.02225</td>\n","      <td>0.05375</td>\n","      <td>0.03775</td>\n","      <td>0.03075</td>\n","      <td>0.05800</td>\n","      <td>0.00475</td>\n","      <td>0.03750</td>\n","      <td>0.17800</td>\n","      <td>0.01600</td>\n","      <td>0.02075</td>\n","      <td>0.38650</td>\n","      <td>0.09650</td>\n","      <td>0.02425</td>\n","      <td>0.01300</td>\n","      <td>0.29250</td>\n","      <td>0.09375</td>\n","      <td>0.04975</td>\n","      <td>0.02225</td>\n","      <td>0.24300</td>\n","      <td>0.38525</td>\n","      <td>0.18725</td>\n","      <td>0.21700</td>\n","      <td>0.13525</td>\n","      <td>0.01800</td>\n","      <td>0.08725</td>\n","      <td>0.05250</td>\n","      <td>0.01575</td>\n","      <td>0.01250</td>\n","      <td>0.02000</td>\n","      <td>0.12225</td>\n","      <td>0.03275</td>\n","      <td>0.02100</td>\n","      <td>0.01100</td>\n","      <td>0.10525</td>\n","      <td>0.01975</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>0.04675</td>\n","      <td>0.05550</td>\n","      <td>0.02925</td>\n","      <td>0.08700</td>\n","      <td>0.04750</td>\n","      <td>0.04775</td>\n","      <td>0.04600</td>\n","      <td>0.14275</td>\n","      <td>0.0285</td>\n","      <td>0.03875</td>\n","      <td>0.02450</td>\n","      <td>0.06475</td>\n","      <td>0.08100</td>\n","      <td>0.00550</td>\n","      <td>0.00500</td>\n","      <td>0.03475</td>\n","      <td>0.00675</td>\n","      <td>0.11375</td>\n","      <td>0.16025</td>\n","      <td>0.14075</td>\n","      <td>0.25200</td>\n","      <td>0.19375</td>\n","      <td>0.10425</td>\n","      <td>0.01675</td>\n","      <td>0.04875</td>\n","      <td>0.06450</td>\n","      <td>0.13175</td>\n","      <td>0.08625</td>\n","      <td>0.32150</td>\n","      <td>0.09550</td>\n","      <td>0.01200</td>\n","      <td>0.03575</td>\n","      <td>0.05975</td>\n","      <td>0.06625</td>\n","      <td>0.05300</td>\n","      <td>0.28575</td>\n","      <td>0.05275</td>\n","      <td>0.02900</td>\n","      <td>0.03650</td>\n","      <td>...</td>\n","      <td>0.10175</td>\n","      <td>0.10725</td>\n","      <td>0.1960</td>\n","      <td>0.09850</td>\n","      <td>0.04950</td>\n","      <td>0.02100</td>\n","      <td>0.06250</td>\n","      <td>0.03500</td>\n","      <td>0.03150</td>\n","      <td>0.07600</td>\n","      <td>0.02000</td>\n","      <td>0.04725</td>\n","      <td>0.14125</td>\n","      <td>0.42725</td>\n","      <td>0.03525</td>\n","      <td>0.24350</td>\n","      <td>0.06100</td>\n","      <td>0.02000</td>\n","      <td>0.03800</td>\n","      <td>0.13025</td>\n","      <td>0.13325</td>\n","      <td>0.03950</td>\n","      <td>0.02500</td>\n","      <td>0.01950</td>\n","      <td>0.02950</td>\n","      <td>0.22325</td>\n","      <td>0.02650</td>\n","      <td>0.35075</td>\n","      <td>0.02150</td>\n","      <td>0.07325</td>\n","      <td>0.06275</td>\n","      <td>0.01950</td>\n","      <td>0.02225</td>\n","      <td>0.02300</td>\n","      <td>0.12200</td>\n","      <td>0.03475</td>\n","      <td>0.01700</td>\n","      <td>0.01800</td>\n","      <td>0.09100</td>\n","      <td>0.01775</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>0.03425</td>\n","      <td>0.03800</td>\n","      <td>0.04050</td>\n","      <td>0.03100</td>\n","      <td>0.06500</td>\n","      <td>0.03575</td>\n","      <td>0.02900</td>\n","      <td>0.08650</td>\n","      <td>0.0320</td>\n","      <td>0.03150</td>\n","      <td>0.02800</td>\n","      <td>0.03475</td>\n","      <td>0.07775</td>\n","      <td>0.01325</td>\n","      <td>0.00325</td>\n","      <td>0.02650</td>\n","      <td>0.01875</td>\n","      <td>0.13375</td>\n","      <td>0.14700</td>\n","      <td>0.11025</td>\n","      <td>0.50700</td>\n","      <td>0.46175</td>\n","      <td>0.11000</td>\n","      <td>0.01700</td>\n","      <td>0.07450</td>\n","      <td>0.06075</td>\n","      <td>0.12525</td>\n","      <td>0.61775</td>\n","      <td>0.14875</td>\n","      <td>0.13150</td>\n","      <td>0.01350</td>\n","      <td>0.04050</td>\n","      <td>0.05250</td>\n","      <td>0.03725</td>\n","      <td>0.04550</td>\n","      <td>0.10175</td>\n","      <td>0.09650</td>\n","      <td>0.01225</td>\n","      <td>0.01800</td>\n","      <td>...</td>\n","      <td>0.08800</td>\n","      <td>0.10750</td>\n","      <td>0.2115</td>\n","      <td>0.11625</td>\n","      <td>0.06575</td>\n","      <td>0.02975</td>\n","      <td>0.04350</td>\n","      <td>0.03425</td>\n","      <td>0.02000</td>\n","      <td>0.06650</td>\n","      <td>0.01550</td>\n","      <td>0.02050</td>\n","      <td>0.28950</td>\n","      <td>0.08225</td>\n","      <td>0.02700</td>\n","      <td>0.21975</td>\n","      <td>0.06975</td>\n","      <td>0.02525</td>\n","      <td>0.01800</td>\n","      <td>0.14775</td>\n","      <td>0.06450</td>\n","      <td>0.22400</td>\n","      <td>0.03850</td>\n","      <td>0.02275</td>\n","      <td>0.03625</td>\n","      <td>0.10725</td>\n","      <td>0.02875</td>\n","      <td>0.97525</td>\n","      <td>0.02075</td>\n","      <td>0.38650</td>\n","      <td>0.05325</td>\n","      <td>0.02800</td>\n","      <td>0.01675</td>\n","      <td>0.03875</td>\n","      <td>0.18200</td>\n","      <td>0.07050</td>\n","      <td>0.01625</td>\n","      <td>0.01425</td>\n","      <td>0.08850</td>\n","      <td>0.01500</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>0.04300</td>\n","      <td>0.05325</td>\n","      <td>0.03800</td>\n","      <td>0.04100</td>\n","      <td>0.05400</td>\n","      <td>0.06725</td>\n","      <td>0.02775</td>\n","      <td>0.07650</td>\n","      <td>0.0215</td>\n","      <td>0.02975</td>\n","      <td>0.02775</td>\n","      <td>0.03300</td>\n","      <td>0.05050</td>\n","      <td>0.00825</td>\n","      <td>0.00300</td>\n","      <td>0.02525</td>\n","      <td>0.01800</td>\n","      <td>0.15475</td>\n","      <td>0.15575</td>\n","      <td>0.16825</td>\n","      <td>0.28925</td>\n","      <td>0.19800</td>\n","      <td>0.08900</td>\n","      <td>0.02250</td>\n","      <td>0.04425</td>\n","      <td>0.04775</td>\n","      <td>0.21750</td>\n","      <td>0.11300</td>\n","      <td>0.16350</td>\n","      <td>0.11875</td>\n","      <td>0.01150</td>\n","      <td>0.03500</td>\n","      <td>0.06300</td>\n","      <td>0.02575</td>\n","      <td>0.10925</td>\n","      <td>0.19875</td>\n","      <td>0.03225</td>\n","      <td>0.02800</td>\n","      <td>0.05175</td>\n","      <td>...</td>\n","      <td>0.08275</td>\n","      <td>0.11925</td>\n","      <td>0.1850</td>\n","      <td>0.11875</td>\n","      <td>0.07150</td>\n","      <td>0.01475</td>\n","      <td>0.05450</td>\n","      <td>0.03475</td>\n","      <td>0.02800</td>\n","      <td>0.07075</td>\n","      <td>0.00650</td>\n","      <td>0.02800</td>\n","      <td>0.12025</td>\n","      <td>0.64475</td>\n","      <td>0.02025</td>\n","      <td>0.29350</td>\n","      <td>0.05900</td>\n","      <td>0.02025</td>\n","      <td>0.02275</td>\n","      <td>0.16425</td>\n","      <td>0.09125</td>\n","      <td>0.07850</td>\n","      <td>0.03275</td>\n","      <td>0.02450</td>\n","      <td>0.03500</td>\n","      <td>0.10475</td>\n","      <td>0.03350</td>\n","      <td>0.40225</td>\n","      <td>0.01875</td>\n","      <td>0.11200</td>\n","      <td>0.05350</td>\n","      <td>0.02050</td>\n","      <td>0.01425</td>\n","      <td>0.02550</td>\n","      <td>0.19225</td>\n","      <td>0.02675</td>\n","      <td>0.01625</td>\n","      <td>0.01300</td>\n","      <td>0.08700</td>\n","      <td>0.01600</td>\n","    </tr>\n","  </tbody>\n","</table>\n","<p>5 rows × 1129 columns</p>\n","</div>"],"text/plain":["   movieId        1        2        3  ...     1125     1126     1127     1128\n","0        1  0.02875  0.02375  0.06250  ...  0.03900  0.02975  0.08475  0.02200\n","1        2  0.04125  0.04050  0.06275  ...  0.02100  0.01100  0.10525  0.01975\n","2        3  0.04675  0.05550  0.02925  ...  0.01700  0.01800  0.09100  0.01775\n","3        4  0.03425  0.03800  0.04050  ...  0.01625  0.01425  0.08850  0.01500\n","4        5  0.04300  0.05325  0.03800  ...  0.01625  0.01300  0.08700  0.01600\n","\n","[5 rows x 1129 columns]"]},"metadata":{"tags":[]},"execution_count":11}]},{"cell_type":"code","metadata":{"id":"MgC4675jS9Sm","executionInfo":{"status":"ok","timestamp":1606352856224,"user_tz":180,"elapsed":723,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["def set_genres(genres,col):\n","    if genres in col.split('|'): return 1\n","    else: return 0\n","mov_genres_df = movies_data"],"execution_count":12,"outputs":[]},{"cell_type":"code","metadata":{"id":"ERkfQt1bTAL2","executionInfo":{"status":"ok","timestamp":1606352871169,"user_tz":180,"elapsed":11269,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["mov_genres_df[\"Action\"] = mov_genres_df.apply(lambda x: set_genres(\"Action\",x['genres']), axis=1)\n","mov_genres_df[\"Adventure\"] = mov_genres_df.apply(lambda x: set_genres(\"Adventure\",x['genres']), axis=1)\n","mov_genres_df[\"Animation\"] = mov_genres_df.apply(lambda x: set_genres(\"Animation\",x['genres']), axis=1)\n","mov_genres_df[\"Children\"] = mov_genres_df.apply(lambda x: set_genres(\"Children\",x['genres']), axis=1)\n","mov_genres_df[\"Comedy\"] = mov_genres_df.apply(lambda x: set_genres(\"Comedy\",x['genres']), axis=1)\n","mov_genres_df[\"Crime\"] = mov_genres_df.apply(lambda x: set_genres(\"Crime\",x['genres']), axis=1)\n","mov_genres_df[\"Documentary\"] = mov_genres_df.apply(lambda x: set_genres(\"Documentary\",x['genres']), axis=1)\n","mov_genres_df[\"Drama\"] = mov_genres_df.apply(lambda x: set_genres(\"Drama\",x['genres']), axis=1)\n","mov_genres_df[\"Fantasy\"] = mov_genres_df.apply(lambda x: set_genres(\"Fantasy\",x['genres']), axis=1)\n","mov_genres_df[\"Film-Noir\"] = mov_genres_df.apply(lambda x: set_genres(\"Film-Noir\",x['genres']), axis=1)\n","mov_genres_df[\"Horror\"] = mov_genres_df.apply(lambda x: set_genres(\"Horror\",x['genres']), axis=1)\n","mov_genres_df[\"Musical\"] = mov_genres_df.apply(lambda x: set_genres(\"Musical\",x['genres']), axis=1)\n","mov_genres_df[\"Mystery\"] = mov_genres_df.apply(lambda x: set_genres(\"Mystery\",x['genres']), axis=1)\n","mov_genres_df[\"Romance\"] = mov_genres_df.apply(lambda x: set_genres(\"Romance\",x['genres']), axis=1)\n","mov_genres_df[\"Sci-Fi\"] = mov_genres_df.apply(lambda x: set_genres(\"Sci-Fi\",x['genres']), axis=1)\n","mov_genres_df[\"Thriller\"] = mov_genres_df.apply(lambda x: set_genres(\"Thriller\",x['genres']), axis=1)\n","mov_genres_df[\"War\"] = mov_genres_df.apply(lambda x: set_genres(\"War\",x['genres']), axis=1)\n","mov_genres_df[\"Western\"] = mov_genres_df.apply(lambda x: set_genres(\"Western\",x['genres']), axis=1)\n","mov_genres_df[\"(no genres listed)\"] = mov_genres_df.apply(lambda x: set_genres(\"(no genres listed)\",x['genres']), axis=1)"],"execution_count":13,"outputs":[]},{"cell_type":"code","metadata":{"id":"kj3jiYa3TBiO","colab":{"base_uri":"https://localhost:8080/","height":258},"executionInfo":{"status":"ok","timestamp":1606352873739,"user_tz":180,"elapsed":647,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"4ddfda44-a2e4-4b39-829b-0bbbb90f9fe2"},"source":["mov_genres_df.drop(['title','genres'], axis = 1, inplace=True)\n","mov_genres_df.head()"],"execution_count":14,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>Action</th>\n","      <th>Adventure</th>\n","      <th>Animation</th>\n","      <th>Children</th>\n","      <th>Comedy</th>\n","      <th>Crime</th>\n","      <th>Documentary</th>\n","      <th>Drama</th>\n","      <th>Fantasy</th>\n","      <th>Film-Noir</th>\n","      <th>Horror</th>\n","      <th>Musical</th>\n","      <th>Mystery</th>\n","      <th>Romance</th>\n","      <th>Sci-Fi</th>\n","      <th>Thriller</th>\n","      <th>War</th>\n","      <th>Western</th>\n","      <th>(no genres listed)</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>1</td>\n","      <td>1</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>1</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","      <td>0</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId  Action  Adventure  ...  War  Western  (no genres listed)\n","0        1       0          1  ...    0        0                   0\n","1        2       0          1  ...    0        0                   0\n","2        3       0          0  ...    0        0                   0\n","3        4       0          0  ...    0        0                   0\n","4        5       0          0  ...    0        0                   0\n","\n","[5 rows x 20 columns]"]},"metadata":{"tags":[]},"execution_count":14}]},{"cell_type":"code","metadata":{"id":"9W7QX3MVTFAT","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352877005,"user_tz":180,"elapsed":1430,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"99f727b2-abff-40eb-fb3e-e949a8c829e7"},"source":["movies = pd.read_csv(\"Datasets/movies.csv\")\n","def set_year(title):\n","    year = title.strip()[-5:-1]\n","    if str(year).isnumeric() == True: return int(year)\n","    else: return 1800\n","#add year field\n","movies['year'] = movies.apply(lambda x: set_year(x['title']), axis=1)\n","movies = movies.drop('genres', axis = 1)\n","movies.head()"],"execution_count":15,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>title</th>\n","      <th>year</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Toy Story (1995)</td>\n","      <td>1995</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>Jumanji (1995)</td>\n","      <td>1995</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>Grumpier Old Men (1995)</td>\n","      <td>1995</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>Waiting to Exhale (1995)</td>\n","      <td>1995</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>Father of the Bride Part II (1995)</td>\n","      <td>1995</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId                               title  year\n","0        1                    Toy Story (1995)  1995\n","1        2                      Jumanji (1995)  1995\n","2        3             Grumpier Old Men (1995)  1995\n","3        4            Waiting to Exhale (1995)  1995\n","4        5  Father of the Bride Part II (1995)  1995"]},"metadata":{"tags":[]},"execution_count":15}]},{"cell_type":"code","metadata":{"id":"KB9PbSnETGx4","executionInfo":{"status":"ok","timestamp":1606352889916,"user_tz":180,"elapsed":1063,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["#define function to group years\n","def set_year_group(year):\n","    if (year < 1900): return 0\n","    elif (1900 <= year <= 1975): return 1\n","    elif (1976 <= year <= 1995): return 2\n","    elif (1996 <= year <= 2003): return 3\n","    elif (2004 <= year <= 2009): return 4\n","    elif (2010 <= year): return 5\n","    else: return 0\n","movies['year_group'] = movies.apply(lambda x: set_year_group(x['year']), axis=1)\n","#no need title and year fields\n","movies.drop(['title','year'], axis = 1, inplace=True)"],"execution_count":16,"outputs":[]},{"cell_type":"code","metadata":{"id":"-2SJKk8ATIkQ","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352892070,"user_tz":180,"elapsed":646,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"b569e496-af1f-4262-a475-34194bf34601"},"source":["agg_movies_rat = ratings_data.groupby(['movieId']).agg({'rating': [np.size, np.mean]}).reset_index()\n","agg_movies_rat.columns = ['movieId','rating_counts', 'rating_mean']\n","agg_movies_rat.head()"],"execution_count":17,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>rating_counts</th>\n","      <th>rating_mean</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>1737.0</td>\n","      <td>3.893782</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>709.0</td>\n","      <td>3.327221</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>388.0</td>\n","      <td>3.126289</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>64.0</td>\n","      <td>2.867188</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>370.0</td>\n","      <td>3.171622</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId  rating_counts  rating_mean\n","0        1         1737.0     3.893782\n","1        2          709.0     3.327221\n","2        3          388.0     3.126289\n","3        4           64.0     2.867188\n","4        5          370.0     3.171622"]},"metadata":{"tags":[]},"execution_count":17}]},{"cell_type":"code","metadata":{"id":"gJdjBSx0TKzM","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606352893906,"user_tz":180,"elapsed":691,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"20e29bbb-4f9d-45fd-f931-302eab072bbb"},"source":["#define function to group rating counts\n","def set_rating_group(rating_counts):\n","    if (rating_counts <= 1): return 0\n","    elif (2 <= rating_counts <= 10): return 1\n","    elif (11 <= rating_counts <= 100): return 2\n","    elif (101 <= rating_counts <= 1000): return 3\n","    elif (1001 <= rating_counts <= 5000): return 4\n","    elif (5001 <= rating_counts): return 5\n","    else: return 0\n","agg_movies_rat['rating_group'] = agg_movies_rat.apply(lambda x: set_rating_group(x['rating_counts']), axis=1)\n","#no need rating_counts field\n","agg_movies_rat.drop('rating_counts', axis = 1, inplace=True)\n","mov_rating_df = movies.merge(agg_movies_rat, left_on='movieId', right_on='movieId', how='left')\n","mov_rating_df = mov_rating_df.fillna(0)\n","mov_rating_df.head()"],"execution_count":18,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>year_group</th>\n","      <th>rating_mean</th>\n","      <th>rating_group</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>2</td>\n","      <td>3.893782</td>\n","      <td>4.0</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>2</td>\n","      <td>3.327221</td>\n","      <td>3.0</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>2</td>\n","      <td>3.126289</td>\n","      <td>3.0</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>2</td>\n","      <td>2.867188</td>\n","      <td>2.0</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>2</td>\n","      <td>3.171622</td>\n","      <td>3.0</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId  year_group  rating_mean  rating_group\n","0        1           2     3.893782           4.0\n","1        2           2     3.327221           3.0\n","2        3           2     3.126289           3.0\n","3        4           2     2.867188           2.0\n","4        5           2     3.171622           3.0"]},"metadata":{"tags":[]},"execution_count":18}]},{"cell_type":"code","metadata":{"id":"lMN7tfHWTMoO","executionInfo":{"status":"ok","timestamp":1606352895492,"user_tz":180,"elapsed":607,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}}},"source":["mov_tag_df = mov_tag_df.set_index('movieId')\n","mov_genres_df = mov_genres_df.set_index('movieId')\n","mov_rating_df = mov_rating_df.set_index('movieId')"],"execution_count":19,"outputs":[]},{"cell_type":"code","metadata":{"id":"5WadDrCfL-h1"},"source":["#cosine similarity for mov_tag_df\n","cos_tag = cosine_similarity(mov_tag_df.values)*0.5\n","#cosine similarity for mov_genres_df\n","cos_genres = cosine_similarity(mov_genres_df.values)*0.25\n","#cosine similarity for mov_rating_df\n","cos_rating = cosine_similarity(mov_rating_df.values)*0.25\n","#mix\n","cos = cos_tag+cos_genres+cos_rating"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"cVIweKtxTP1d"},"source":["cols = mov_tag_df.index.values\n","inx = mov_tag_df.index\n","movies_sim = pd.DataFrame(cos, columns=cols, index=inx)\n","movies_sim.head()"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"LaisRXFeTRsW"},"source":["def get_similar(movieId):\n","    df = movies_sim.loc[movies_sim.index == movieId].reset_index(). \\\n","            melt(id_vars='movieId', var_name='sim_moveId', value_name='relevance'). \\\n","            sort_values('relevance', axis=0, ascending=False)[1:6]\n","    return df\n","#create empty df\n","movies_similarity = pd.DataFrame(columns=['movieId','sim_moveId','relevance'])"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"EIJpfpN3TTPu","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349657565,"user_tz":180,"elapsed":107196,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"43f5851f-cb29-4c19-d97e-c92eba137396"},"source":["for x in movies_sim.index.tolist():\n","    movies_similarity = movies_similarity.append(get_similar(x))\n","movies_similarity.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>sim_moveId</th>\n","      <th>relevance</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>4780</th>\n","      <td>1</td>\n","      <td>4886</td>\n","      <td>0.975168</td>\n","    </tr>\n","    <tr>\n","      <th>3021</th>\n","      <td>1</td>\n","      <td>3114</td>\n","      <td>0.973067</td>\n","    </tr>\n","    <tr>\n","      <th>2264</th>\n","      <td>1</td>\n","      <td>2355</td>\n","      <td>0.942664</td>\n","    </tr>\n","    <tr>\n","      <th>6258</th>\n","      <td>1</td>\n","      <td>6377</td>\n","      <td>0.935154</td>\n","    </tr>\n","    <tr>\n","      <th>2203</th>\n","      <td>1</td>\n","      <td>2294</td>\n","      <td>0.934395</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["     movieId sim_moveId  relevance\n","4780       1       4886   0.975168\n","3021       1       3114   0.973067\n","2264       1       2355   0.942664\n","6258       1       6377   0.935154\n","2203       1       2294   0.934395"]},"metadata":{"tags":[]},"execution_count":26}]},{"cell_type":"code","metadata":{"id":"wFZJjiGwTVJ-"},"source":["def movie_recommender(movieId):\n","    df = movies_sim.loc[movies_sim.index == movieId].reset_index(). \\\n","            melt(id_vars='movieId', var_name='sim_moveId', value_name='relevance'). \\\n","            sort_values('relevance', axis=0, ascending=False)[1:6]\n","    df['sim_moveId'] = df['sim_moveId'].astype(int)\n","    sim_df = movies_data.merge(df, left_on='movieId', right_on='sim_moveId', how='inner'). \\\n","                sort_values('relevance', axis=0, ascending=False). \\\n","                loc[: , ['movieId_y','title','genres']]. \\\n","                rename(columns={ 'movieId_y': \"movieId\" })\n","    return sim_df"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"ne02KPTDTW1y","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349701188,"user_tz":180,"elapsed":565,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"b65a9f36-14f5-4782-bb02-e4348ee03b36"},"source":["#get recommendation for Toy Story\n","movie_recommender(1)"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>title</th>\n","      <th>genres</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>3</th>\n","      <td>1</td>\n","      <td>Monsters, Inc. (2001)</td>\n","      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>1</td>\n","      <td>Toy Story 2 (1999)</td>\n","      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>1</td>\n","      <td>Bug's Life, A (1998)</td>\n","      <td>Adventure|Animation|Children|Comedy</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>1</td>\n","      <td>Finding Nemo (2003)</td>\n","      <td>Adventure|Animation|Children|Comedy</td>\n","    </tr>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Antz (1998)</td>\n","      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId                  title                                       genres\n","3        1  Monsters, Inc. (2001)  Adventure|Animation|Children|Comedy|Fantasy\n","2        1     Toy Story 2 (1999)  Adventure|Animation|Children|Comedy|Fantasy\n","1        1   Bug's Life, A (1998)          Adventure|Animation|Children|Comedy\n","4        1    Finding Nemo (2003)          Adventure|Animation|Children|Comedy\n","0        1            Antz (1998)  Adventure|Animation|Children|Comedy|Fantasy"]},"metadata":{"tags":[]},"execution_count":33}]},{"cell_type":"code","metadata":{"id":"_WpdWcByTY-w"},"source":["#get recommendation for Inception\n","#movie_recommender(79132)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"vjCN8HmZTbFQ"},"source":["#get recommendation for X-Men\n","movie_recommender(3793)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"S7zb4BznTc1C"},"source":["#get recommendation for Lock, Stock & Two Smoking Barrels\n","movie_recommender(2542)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"ww016Sc1TeX2"},"source":["#get recommendation for Casino Royale\n","#movie_recommender(49272)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"duJMeONiTf_Z"},"source":["#get recommendation for Hangover Part II\n","#movie_recommender(86911)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"stjnELRATiDZ"},"source":["#get recommendation for Eternal Sunshine of the Spotless Mind\n","movie_recommender(7361)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"0we6CIxLTj9i"},"source":["#get recommendation for Scream 4\n","#movie_recommender(86295)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"776g9ZQhToxk","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349658466,"user_tz":180,"elapsed":831,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"95bb2dbb-4df9-4344-c576-2066e195bb85"},"source":["users_df = pd.DataFrame(ratings_data['userId'].unique(), columns=['userId'])\n","users_df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>userId</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   userId\n","0       1\n","1       2\n","2       3\n","3       4\n","4       5"]},"metadata":{"tags":[]},"execution_count":29}]},{"cell_type":"code","metadata":{"id":"AV4IBArRTqRv","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349706011,"user_tz":180,"elapsed":558,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"97100921-5e8f-414d-afa0-8e72f1663947"},"source":["#create movies_df\n","movies_df = movies_data.drop('genres', axis = 1)\n","#calculate mean of ratings for each movies\n","agg_rating_avg = ratings_data.groupby(['movieId']).agg({'rating': np.mean}).reset_index()\n","agg_rating_avg.columns = ['movieId', 'rating_mean']\n","#merge\n","movies_df = movies_df.merge(agg_rating_avg, left_on='movieId', right_on='movieId', how='left')\n","movies_df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>title</th>\n","      <th>year</th>\n","      <th>rating_mean</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Toy Story (1995)</td>\n","      <td>1995</td>\n","      <td>3.908447</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>2</td>\n","      <td>Jumanji (1995)</td>\n","      <td>1995</td>\n","      <td>3.283170</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>3</td>\n","      <td>Grumpier Old Men (1995)</td>\n","      <td>1995</td>\n","      <td>3.116438</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>4</td>\n","      <td>Waiting to Exhale (1995)</td>\n","      <td>1995</td>\n","      <td>2.897959</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>5</td>\n","      <td>Father of the Bride Part II (1995)</td>\n","      <td>1995</td>\n","      <td>3.102759</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   movieId                               title  year  rating_mean\n","0        1                    Toy Story (1995)  1995     3.908447\n","1        2                      Jumanji (1995)  1995     3.283170\n","2        3             Grumpier Old Men (1995)  1995     3.116438\n","3        4            Waiting to Exhale (1995)  1995     2.897959\n","4        5  Father of the Bride Part II (1995)  1995     3.102759"]},"metadata":{"tags":[]},"execution_count":34}]},{"cell_type":"code","metadata":{"id":"vuNkCzVNTvL1","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349710094,"user_tz":180,"elapsed":608,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"0ec8e601-0b0e-4e61-b3cf-fd48c73fc3b0"},"source":["genres = [\n","    \"Action\",\n","    \"Adventure\",\n","    \"Animation\",\n","    \"Children\",\n","    \"Comedy\",\n","    \"Crime\",\n","    \"Documentary\",\n","    \"Drama\",\n","    \"Fantasy\",\n","    \"Film-Noir\",\n","    \"Horror\",\n","    \"Musical\",\n","    \"Mystery\",\n","    \"Romance\",\n","    \"Sci-Fi\",\n","    \"Thriller\",\n","    \"War\",\n","    \"Western\",\n","    \"(no genres listed)\"]\n","genres_df = pd.DataFrame(genres, columns=['genres'])\n","genres_df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>genres</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Action</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>Adventure</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Animation</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Children</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Comedy</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["      genres\n","0     Action\n","1  Adventure\n","2  Animation\n","3   Children\n","4     Comedy"]},"metadata":{"tags":[]},"execution_count":35}]},{"cell_type":"code","metadata":{"id":"3d0HzwqpTw3h","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349710983,"user_tz":180,"elapsed":611,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"e898e4b2-39f0-4d33-caf1-2d7a64fe6b7a"},"source":["users_movies_df = ratings_data.drop('timestamp', axis = 1)\n","users_movies_df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>userId</th>\n","      <th>movieId</th>\n","      <th>rating</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>296</td>\n","      <td>5.0</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>1</td>\n","      <td>306</td>\n","      <td>3.5</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>1</td>\n","      <td>307</td>\n","      <td>5.0</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>1</td>\n","      <td>665</td>\n","      <td>5.0</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>1</td>\n","      <td>899</td>\n","      <td>3.5</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   userId  movieId  rating\n","0       1      296     5.0\n","1       1      306     3.5\n","2       1      307     5.0\n","3       1      665     5.0\n","4       1      899     3.5"]},"metadata":{"tags":[]},"execution_count":36}]},{"cell_type":"code","metadata":{"id":"LX8Q9tN9TyNC"},"source":["movies_genres_df = movies_data.drop('title', axis = 1)"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"At6UuFWwTzWZ"},"source":["#define a function to split genres field\n","def get_movie_genres(movieId):\n","    movie = movies_genres_df[movies_genres_df['movieId']==movieId]\n","    genres = movie['genres'].tolist()\n","    df = pd.DataFrame([b for a in [i.split('|') for i in genres] for b in a], columns=['genres'])\n","    df.insert(loc=0, column='movieId', value=movieId)\n","    return df"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"hqk3PSfQT0o9","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349736638,"user_tz":180,"elapsed":23253,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"8da5d21f-ab2d-4ca4-a8ff-bbbcb66de674"},"source":["#create empty df\n","movies_genres=pd.DataFrame(columns=['movieId','genres'])\n","for x in movies_genres_df['movieId'].tolist():\n","    movies_genres=movies_genres.append(get_movie_genres(x))\n","movies_genres.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>movieId</th>\n","      <th>genres</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Adventure</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>1</td>\n","      <td>Animation</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>1</td>\n","      <td>Children</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>1</td>\n","      <td>Comedy</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>1</td>\n","      <td>Fantasy</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["  movieId     genres\n","0       1  Adventure\n","1       1  Animation\n","2       1   Children\n","3       1     Comedy\n","4       1    Fantasy"]},"metadata":{"tags":[]},"execution_count":39}]},{"cell_type":"code","metadata":{"id":"0kl-NP2_T2MT","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349737609,"user_tz":180,"elapsed":939,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"0e3ed182-c0a4-4382-b8d1-644339540b97"},"source":["#join to movies data to get genre information\n","user_genres_df = ratings_data.merge(movies_data, left_on='movieId', right_on='movieId', how='left')\n","#drop columns that will not be used\n","user_genres_df.drop(['movieId','rating','timestamp','title'], axis = 1, inplace=True)\n","user_genres_df.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>userId</th>\n","      <th>genres</th>\n","      <th>year</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Comedy|Crime|Drama|Thriller</td>\n","      <td>1994</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>1</td>\n","      <td>Drama</td>\n","      <td>1994</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>1</td>\n","      <td>Drama</td>\n","      <td>1993</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>1</td>\n","      <td>Comedy|Drama|War</td>\n","      <td>1995</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>1</td>\n","      <td>Comedy|Musical|Romance</td>\n","      <td>1952</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["   userId                       genres  year\n","0       1  Comedy|Crime|Drama|Thriller  1994\n","1       1                        Drama  1994\n","2       1                        Drama  1993\n","3       1             Comedy|Drama|War  1995\n","4       1       Comedy|Musical|Romance  1952"]},"metadata":{"tags":[]},"execution_count":40}]},{"cell_type":"code","metadata":{"id":"pUJmhFhJT36E"},"source":["def get_favorite_genre(userId):\n","    user = user_genres_df[user_genres_df['userId']==userId]\n","    genres = user['genres'].tolist()\n","    movie_list = [b for a in [i.split('|') for i in genres] for b in a]\n","    counter = Counter(movie_list)\n","    return counter.most_common(1)[0][0]"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"YXp8WNmoT535","colab":{"base_uri":"https://localhost:8080/","height":204},"executionInfo":{"status":"ok","timestamp":1606349858656,"user_tz":180,"elapsed":44538,"user":{"displayName":"Douglas Luan de Souza","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14GhQt8FS-yXFtqdjeuz3bOlVkN6Q8WoauX_MTbC6pg=s64","userId":"12483287636186234399"}},"outputId":"d1635003-3627-4af8-ce1a-9dbe0475baf6"},"source":["#create empty df\n","users_genres = pd.DataFrame(columns=['userId','genre'])\n","for x in users_df['userId'].tolist():\n","    users_genres = users_genres.append(pd.DataFrame([[x,get_favorite_genre(x)]], columns=['userId','genre']))\n","users_genres.head()"],"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>userId</th>\n","      <th>genre</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>1</td>\n","      <td>Drama</td>\n","    </tr>\n","    <tr>\n","      <th>0</th>\n","      <td>2</td>\n","      <td>Drama</td>\n","    </tr>\n","    <tr>\n","      <th>0</th>\n","      <td>3</td>\n","      <td>Action</td>\n","    </tr>\n","    <tr>\n","      <th>0</th>\n","      <td>4</td>\n","      <td>Action</td>\n","    </tr>\n","    <tr>\n","      <th>0</th>\n","      <td>5</td>\n","      <td>Comedy</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["  userId   genre\n","0      1   Drama\n","0      2   Drama\n","0      3  Action\n","0      4  Action\n","0      5  Comedy"]},"metadata":{"tags":[]},"execution_count":43}]},{"cell_type":"code","metadata":{"id":"Ra_1bx9zT8Vk"},"source":["res_path = 'experiment/results/'\n","users_df.to_csv(res_path+'users.csv', sep='|', header=True, index=False)\n","movies_df.to_csv(res_path+'movies.csv', sep='|', header=True, index=False)\n","genres_df.to_csv(res_path+'genres.csv', sep='|', header=True, index=False)\n","users_movies_df.to_csv(res_path+'users_movies.csv', sep='|', header=True, index=False)\n","movies_genres.to_csv(res_path+'movies_genres.csv', sep='|', header=True, index=False)\n","users_genres.to_csv(res_path+'users_genres.csv', sep='|', header=True, index=False)\n","movies_similarity.to_csv(res_path+'movies_similarity.csv', sep='|', header=True, index=False)"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"bJZxxZk98PEn"},"source":["COMUNICAÇÃO E SETUP DO DATABASE USANDO NEO4J SANDBOX"]},{"cell_type":"code","metadata":{"id":"3BOGrOnxouEh","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1606262534877,"user_tz":180,"elapsed":79929,"user":{"displayName":"Tulio Oliveira Araujo","photoUrl":"","userId":"14329466076200335654"}},"outputId":"a7be0b54-7c02-43dd-fab2-5820639cd22f"},"source":["!pip install neo4j"],"execution_count":null,"outputs":[{"output_type":"stream","text":["Collecting neo4j\n","\u001b[?25l  Downloading https://files.pythonhosted.org/packages/ba/9c/96069a907f845ec74a5031d7a2fa2cacfa2f52ad2f312ee1e9ba45364ff7/neo4j-4.2.0.tar.gz (66kB)\n","\r\u001b[K     |█████                           | 10kB 14.8MB/s eta 0:00:01\r\u001b[K     |█████████▉                      | 20kB 19.0MB/s eta 0:00:01\r\u001b[K     |██████████████▊                 | 30kB 9.8MB/s eta 0:00:01\r\u001b[K     |███████████████████▋            | 40kB 7.9MB/s eta 0:00:01\r\u001b[K     |████████████████████████▌       | 51kB 4.3MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▍  | 61kB 4.3MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 71kB 3.3MB/s \n","\u001b[?25hRequirement already satisfied: pytz in /usr/local/lib/python3.6/dist-packages (from neo4j) (2018.9)\n","Building wheels for collected packages: neo4j\n","  Building wheel for neo4j (setup.py) ... \u001b[?25l\u001b[?25hdone\n","  Created wheel for neo4j: filename=neo4j-4.2.0-cp36-none-any.whl size=89357 sha256=fceecab7d2626efc14fd18631b909fce249bd874de51618b402624786d9aa6cb\n","  Stored in directory: /root/.cache/pip/wheels/fd/43/31/a31bcc734daf698306a7de91d10cea66348288bbc7ce16ba23\n","Successfully built neo4j\n","Installing collected packages: neo4j\n","Successfully installed neo4j-4.2.0\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"LeSrMV3Pbrds"},"source":["# create connection to Neo4j instance (NGROK http://127.0.0.1:4040/status)\n","from neo4j import GraphDatabase, basic_auth\n","driver = GraphDatabase.driver(\"bolt://4.tcp.ngrok.io:15806\")"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"dY-0zH-O7mnx"},"source":["# COMUNICAÇÃO COM SANDBOX\n","\n","# pip install neo4j-driver\n","\n","#from neo4j import GraphDatabase, basic_auth\n","\n","#driver = GraphDatabase.driver(\n","#    \"bolt://3.94.213.92:33094\", \n","#    auth=basic_auth(\"neo4j\", \"sharpener-disability-diagnoses\"))\n","#session = driver.session()\n","\n","#cypher_query = '''\n","#MATCH (n)\n","#RETURN id(n) AS id\n","#LIMIT 10\n","#'''\n","\n","#results = session.run(cypher_query,\n","#  parameters={})\n","\n","#for record in results:\n","#  print(record['id'])\n"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"xSWYCjdILeRh","executionInfo":{"status":"ok","timestamp":1606263258940,"user_tz":180,"elapsed":734,"user":{"displayName":"Tulio Oliveira Araujo","photoUrl":"","userId":"14329466076200335654"}},"outputId":"19b47b22-b07e-4c6f-a48e-f40248f63a49"},"source":["with driver.session() as session:\n","    result = session.run(\"MATCH (a) RETURN COUNT(a)\")\n","    for r in result:\n","        print(r)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["<Record COUNT(a)=10122>\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"zyvcF0St8MwC"},"source":["#Users\n","query = (\n","    \"USING PERIODIC COMMIT \"\n","    \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vSRVD9Kvd2kzMl9Z3RiWr8OpAOu2zhJYn8Qz97ItcpsUbpwSjuoF4Nc1mZIKxHLV12WpI-PPZXk_Hxt/pub?output=csv' AS row \"\n","    \"FIELDTERMINATOR '|' \"\n","    \"CREATE (:Users {userId: row.userId});\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())\n","\n","#     try:\n","#            return [{\"p1\": record[\"p1\"][\"name\"], \"p2\": record[\"p2\"][\"name\"]}\n","#                    for record in result]\n","#except ServiceUnavailable as exception:\n","#            logging.error(\"{query} raised an error: \\n {exception}\".format(\n","#                query=query, exception=exception))\n","#            raise\n","#for r in result:\n","#     print(r)\n","    #df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"JW7jqWj7hrPb"},"source":["#Movies\n","query = (\n","      \"USING PERIODIC COMMIT \"\n","      \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vRinOzZZ4wzYcnNMja8tSTvODem3JhtAbf7YEUAcbDkEd5QKjRBrgkr2UcLu6K2s9hfCK1Ce53JqB7V/pubhtml' AS row \"\n","      \"FIELDTERMINATOR '|' \"\n","      \"CREATE (:Movies {movieId: row.movieId, title: row.title, rating_mean: row.rating_mean});\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"r7LjSSa2iTHm"},"source":["#Index - Users\n","query = (\n","      \"CREATE INDEX ON :Users(userId);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"xBKWcFQaiqHY"},"source":["#Index - Movies\n","query = (\n","      \"CREATE INDEX ON :Movies(movieId);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"52kx3peQiupj"},"source":["#User - Movies\n","query = (\n","      \"USING PERIODIC COMMIT \"\n","      \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vQZk7_vYDDqb6p0NzvcSEBEoPxc9QAhQFeDdEdwhyR0z8sr8_DS9hXLSuvwfXI9NAbjuonqmUGWfc9I/pub?output=csv' AS row \"\n","      \"FIELDTERMINATOR '|' \"\n","      \"MATCH (user:Users {userId: row.userId}) \"\n","      \"MATCH (movie:Movies {movieId: row.movieId}) \"\n","      \"MERGE (user)-[:WATCHED {rating: row.rating}]->(movie);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"9tka8DVzkB5x"},"source":["#User - Genres\n","query = (\n","      \"USING PERIODIC COMMIT \"\n","      \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vTElDtSe1C11aLnIcpog-xJsjHOojSyiknqZ1_17NpnNb4NVaJBYva8pr2cyswBf8fSEDUKtrKFkbBo/pub?output=csv' AS row \"\n","      \"FIELDTERMINATOR '|' \"\n","      \"MATCH (user:Users {userId: row.userId}) \"\n","      \"MATCH (genres:Genres {genres: row.genre}) \"\n","      \"MERGE (user)-[:FAVORITE]->(genres);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"uVNHh6XSu9zA"},"source":["#Movies - Genres\n","query = (\n","      \"USING PERIODIC COMMIT \"\n","      \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vTXIXbsn719H_yQIfv7ePC_2-ZLZxkCzZAqU5P8cbnAbaKV-G2TvKFkFyXktOjUEcr10j4X1iSp0nOe/pub?output=csv' AS row \"\n","      \"FIELDTERMINATOR '|' \"\n","      \"MATCH (movie:Movies {movieId: row.movieId}) \"\n","      \"MATCH (genres:Genres {genres: row.genres}) \"\n","      \"MERGE (movie)-[:GENRES]->(genres);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]},{"cell_type":"code","metadata":{"id":"F70aIZBevZpu"},"source":["#Movies - Similarity\n","query = (\n","      \"USING PERIODIC COMMIT \"\n","      \"LOAD CSV WITH HEADERS FROM 'https://docs.google.com/spreadsheets/d/e/2PACX-1vRc7-4MawB5FXK54wrhugAOIsnLi5HPTAz4mql-PwaR1Gbjrxx2-K2aAO2gY1hxAtqow7b5GHUE2QND/pub?output=csv' AS row \"\n","      \"FIELDTERMINATOR '|' \"\n","      \"MATCH (movie1:Movies {movieId: row.movieId}) \"\n","      \"MATCH (movie2:Movies {movieId: row.sim_moveId}) \"\n","      \"MERGE (movie1)-[:SIMILAR {relevance: row.relevance}]->(movie2);\"\n","    )\n","with driver.session() as session:\n","  result = session.run(query)\n","  df = pd.DataFrame(result.data())"],"execution_count":null,"outputs":[]}]}